node {
  name: "depth_prediction/depth_prediction/raw_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 128
        }
        dim {
          size: 416
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/convert_image/Cast"
  op: "Cast"
  input: "depth_prediction/depth_prediction/raw_input"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/convert_image/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.003921568859368563
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/convert_image"
  op: "Mul"
  input: "depth_prediction/depth_prediction/convert_image/Cast"
  input: "depth_prediction/depth_prediction/convert_image/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05914847552776337
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05914847552776337
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/max"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/RandomUniform"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform"
  op: "Add"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/mul"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1/weights"
  input: "depth_prediction/depth_net/cnv1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/weights/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05000000074505806
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "depth_prediction/depth_net/cnv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/kernel/Regularizer/l2_regularizer/scale"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/Conv2D"
  op: "Conv2D"
  input: "depth_prediction/depth_prediction/convert_image"
  input: "depth_prediction/depth_net/cnv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/beta/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/beta"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/beta/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/Conv2D"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/beta/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9990000128746033
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub/x"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg"
  op: "AssignSub"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub/x"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1/Relu"
  op: "Relu"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0437408871948719
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0437408871948719
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/max"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/RandomUniform"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform"
  op: "Add"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/mul"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1b/weights"
  input: "depth_prediction/depth_net/cnv1b/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/weights/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1b/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05000000074505806
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "depth_prediction/depth_net/cnv1b/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/kernel/Regularizer/l2_regularizer/scale"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/Conv2D"
  op: "Conv2D"
  input: "depth_prediction/depth_prediction/depth_net/cnv1/Relu"
  input: "depth_prediction/depth_net/cnv1b/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/beta/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/beta"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/beta/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/Conv2D"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/beta/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9990000128746033
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub/x"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg"
  op: "AssignSub"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub/x"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance/read"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub_1"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv1b/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv1b/Relu"
  op: "Relu"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05000000074505806
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05000000074505806
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/max"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/RandomUniform"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform"
  op: "Add"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/mul"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/Assign"
  op: "Assign"
  input: "depth_prediction/depth_net/cnv2/weights"
  input: "depth_prediction/depth_net/cnv2/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_net/cnv2/weights/read"
  op: "Identity"
  input: "depth_prediction/depth_net/cnv2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@depth_prediction/depth_net/cnv2/weights"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05000000074505806
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "depth_prediction/depth_net/cnv2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "depth_prediction/depth_prediction/depth_net/cnv2/kernel/Regularizer/l2_regularizer/scale"
  input: "depth_prediction/depth_prediction/depth_net/cnv2/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/Conv2D"
  op: "Conv2D"
  input: "depth_prediction/depth_prediction/depth_net/cnv1b/Relu"
  input: "depth_prediction/depth_net/cnv2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "depth_prediction/depth_prediction/depth_net/cnv2/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
